In [86]:
import pandas as pd

In [87]:
student_grade=pd.DataFrame(
data={'Name': ['John Deo', 'Max Ruin', 'Krish Star', 'Alex Jhon', 'Yosef assefa'],
     'Mark':[74, 85, 80, 77, 91],
     'Class': ['math', 'Biology', 'chemisty', 'History','CS'],
     'sex':['female', 'male','famale','male','male'],
     'age':[26,23,25,28,27],
     'Date_of_birth': ['1994-01-06', '1997-05-07', '1995-05-02', '1992-10-01','1991-01-01']},
      columns = ['Name','Mark','Class','sex','age', 'Date_of_birth'])
student_grade

           Name  Mark     Class     sex  age Date_of_birth
0      John Deo    74      math  female   26    1994-01-06
1      Max Ruin    85   Biology    male   23    1997-05-07
2    Krish Star    80  chemisty  famale   25    1995-05-02
3     Alex Jhon    77   History    male   28    1992-10-01
4  Yosef assefa    91        CS    male   27    1991-01-01

In [88]:
ages= student_grade['age']
ages

0    26
1    23
2    25
3    28
4    27
Name: age, dtype: int64

In [89]:
ages.max()

28

In [90]:
Grade= student_grade['Mark']
Grade

0    74
1    85
2    80
3    77
4    91
Name: Mark, dtype: int64

In [91]:
Grade.max()

91

In [92]:
print([Grade.max() - Grade])

[0    17
1     6
2    11
3    14
4     0
Name: Mark, dtype: int64]

In [93]:
Months_of_Birth= pd.to_datetime(student_grade['Date_of_birth'],format='%Y-%m-%d')
Months_of_Birth

0   1994-01-06
1   1997-05-07
2   1995-05-02
3   1992-10-01
4   1991-01-01
Name: Date_of_birth, dtype: datetime64[ns]

In [94]:
Months_of_Birth.dt.month

0     1
1     5
2     5
3    10
4     1
Name: Date_of_birth, dtype: int64

In [95]:
student_grade['Months_of_Birth'] = Months_of_Birth.dt.month

In [96]:
student_grade

           Name  Mark     Class     sex  age Date_of_birth  Months_of_Birth
0      John Deo    74      math  female   26    1994-01-06                1
1      Max Ruin    85   Biology    male   23    1997-05-07                5
2    Krish Star    80  chemisty  famale   25    1995-05-02                5
3     Alex Jhon    77   History    male   28    1992-10-01               10
4  Yosef assefa    91        CS    male   27    1991-01-01                1

In [97]:
student_grade.to_csv('student_grade_clean.csv', index = False)